#include "Signal.h"

void Set_color(int text, int bg)
{
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE); // Получение дескриптора вывода на консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((bg << 4) | text)); // Установка атрибутов текста 
}

// Сохранять ли?___________________________________________________________________________________________________________________________
void Ask_for_saving()  
{
	Set_color(15, 0);
	cout << endl;
	cout << "                                           __________________________________________            " << endl;
	cout << "                                          /                                          \\          " << endl;
	cout << "                                         /            C О Х Р А Н Е Н И Е             \\         " << endl;
	cout << "                                ________/______________________________________________\\________" << endl;
	cout << "                                |                                                              | " << endl;
	cout << "                                |          Вы можете сохранить отсортированные данные!         | " << endl;
	cout << "                                |                                                              | " << endl;
	cout << "                                |______________________________________________________________| " << endl;
	cout << "                                |                                                              | " << endl;
	Set_color(2, 0);
	cout << "                                |                    1 - Да, сохранить                         | " << endl;
	Set_color(12, 0);
	cout << "                                |                    2 - Нет, не сохранять                     | " << endl;
	Set_color(15, 0);
	cout << "                                |                                                              | " << endl;
	cout << "                                |______________________________________________________________| " << endl;
	cout << "                                                       >>";
	Set_color(7, 0);
}

// Такого аккаунта не существует!_______________________________________________________________________________________________________
void Account_not_found() 
{
	Set_color(12, 0);
	cout << endl << endl;
	cout << "                                ________________________________________________________________" << endl;
	cout << "                                |                                                              |" << endl;
	cout << "                                |              Ошибка! Такого аккаунта не существует!          |   " << endl;
	cout << "                                |______________________________________________________________|" << endl;
	Set_color(7, 0);
	Sleep(1000);
	system("cls");
}

//Данные успешно сохранены!__________________________________________________________________________________________________________
void Save_it()
{
	Set_color(2, 0); // Зеленый 
	cout << endl << endl;
	cout << "                                ________________________________________________________________" << endl;
	cout << "                                |                                                              |" << endl;
	cout << "                                |                     Данные успешно сохранены!                |" << endl;
	cout << "                                |______________________________________________________________|" << endl;
	Set_color(7, 0); // Белый
	Sleep(1000);
	system("cls");
}


//Неверный пароль!__________________________________________________________________________________________________________________________

// Передаём по адресу flag и amount чтобы они обновлялись в основной программе. Изначально true | 3 
void Password_incorrect(string TempLogin, bool& flagPassword, int& amount) // Если несколько раз ввели не тот пароль --> выводим сообщение об ошибке
{
	amount--; // Уменьшаем перменную | Если amount дойдет до 0 --> останавливаем цикл while
	system("cls");
	cout << "                                         ____________________________________________ " << endl;
	cout << "                                         |                                          | " << endl;
	Set_color(12, 0); // Красный
	cout << "                                         |             Неверный пароль              | " << endl;
	cout << "                                                       Попыток осталось: " << amount << endl << endl;
	Set_color(7, 0); // Черный 
	cout << "                                         |__________________________________________| " << endl;
	cout << "                                                       Логин: " << TempLogin << endl;
	if (amount == 0)
	{
		Set_color(12, 0); // Светло-красный
		cout << "                             _____________________________________________________________________ " << endl;
		cout << "                             |                                                                   | " << endl;
		cout << "                             |    Вы превысили количество допустимых попыток. Повторите позже    | " << endl;
		cout << "                             |___________________________________________________________________| " << endl;
		Sleep(1500);
		system("cls");
		flagPassword = false; // Возвращаем значение false чтобы остановить цикл
	}
}